cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'homebrew/dupes'
tap 'homebrew/php'
tap 'homebrew/versions'

cask 'java'
cask 'xquartz'

# Search tool like grep, but optimized for programmers
brew 'ack'
# Graphical system information display for OS X
brew 'archey'
# Official Amazon AWS command-line interface
brew 'awscli'
# GNU File, Shell, and Text utilities
brew 'coreutils'
# Toggle the Dark Mode (in OS X 10.10) from the command-line
brew 'dark-mode'
# Lightweight DNS forwarder and DHCP server
brew 'dnsmasq'
# Pack, ship and run any application as a lightweight container
brew 'docker'
# Command-line shell and scripting interface for Drupal
brew 'drush'
# Distributed revision control system
brew 'git', args: ['without-completions']
# Small git utilities
brew 'git-extras'
# Extensions to follow Vincent Driessen's branching model
brew 'git-flow'
# Colorize logfiles and command output
brew 'grc'
# Improved top (interactive process viewer) for OS X
brew 'htop-osx'
# Add GitHub support to git on the command-line
brew 'hub'
# Tools and libraries to manipulate images in many formats
brew 'imagemagick'
# Convert JPG images to ASCII
brew 'jp2a'
# Convert pixel information into colored ASCII art
brew 'libcaca', args: ['with-imlib2']
# C library of Git core methods that is re-entrant and linkable
brew 'libgit2'
# Open source relational database management system
brew 'mysql'
# SSL/TLS cryptography library
brew 'openssl'
# Library for command-line editing
brew 'readline'
# Object-relational database system
brew 'postgresql'
# Install various Ruby versions and implementations
brew 'ruby-build'
# Ruby version manager
brew 'rbenv'
# Unit testing tool
brew 'roundup'
# Utility that provides fast incremental file transfer
brew 'rsync'
# Diff images from the command-line
brew 'spaceman-diff'
# Sparklines for the shell
brew 'spark'
# Add a public key to a remote machine's authorized_keys file
brew 'ssh-copy-id'
# Display directories as trees (with optional color/HTML output)
brew 'tree'
# Granddaddy of HTML tools, with support for modern standards
brew 'tidy-html5'
# Extract, view, and test RAR archives
brew 'unrar'
# Extraction utility for .zip compressed archives
brew 'unzip'
# URL extractor/launcher
brew 'urlview'
# Executes a program periodically, showing output fullscreen
brew 'watch'
# Create screenshots of webpages from the terminal
brew 'webkit2png'
# Image format providing lossless and lossy compression for web images
brew 'webp'
# General-purpose lossless data-compression library
brew 'zlib'
# UNIX shell (command interpreter)
brew 'zsh'
# Everything you need to get started with Heroku
brew 'heroku-toolbelt'
# GNU grep, egrep and fgrep
brew 'homebrew/dupes/grep'
# Internet file retriever
brew 'wget', args: ['enable-iri']
# Command-line tools for managing WordPress installations
brew 'wp-cli'
# Download YouTube videos from the command-line
brew 'youtube-dl'
# Vi "workalike" with many additional features
brew 'vim', args: ['with-lua', 'with-luajit']


cask 'atom'
cask 'coda'
cask 'firefox'
cask 'google-chrome'
cask 'imageoptim'
cask 'opera'
cask 'sequel-pro'
cask 'sketch'
cask 'slack'
cask 'sourcetree'
cask 'sublime-text'
cask 'vagrant'
cask 'vagrant-manager'
cask 'virtualbox'
cask 'vlc'
